In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.Series([1, 2, 3, np.nan, False, True], dtype=pd.Int64Dtype())

0       1
1       2
2       3
3    <NA>
4       0
5       1
dtype: Int64

In [3]:
#Xu ly du lieu khuyet thieu
s = pd.Series([1, 2, 3, np.nan, 5, 6, 7])
s.isna()

0    False
1    False
2    False
3     True
4    False
5    False
6    False
dtype: bool

In [4]:
s.dropna()

0    1.0
1    2.0
2    3.0
4    5.0
5    6.0
6    7.0
dtype: float64

In [5]:
df = pd.DataFrame({
    'name': ['Alfred', 'Batman', 'Catwoman'],
    'toy': ['Batmobile', np.nan, 'Bullwhip'],
    'born': [pd.NaT, pd.Timestamp('1975-12-30'), pd.NaT]
})
df

       name        toy       born
0    Alfred  Batmobile        NaT
1    Batman        NaN 1975-12-30
2  Catwoman   Bullwhip        NaT

In [6]:
df.dropna()

Empty DataFrame
Columns: [name, toy, born]
Index: []

In [7]:
df.dropna(axis='columns')

       name
0    Alfred
1    Batman
2  Catwoman

In [8]:
#Drop row whichh all cells are NaN
df.dropna(how='all')

       name        toy       born
0    Alfred  Batmobile        NaT
1    Batman        NaN 1975-12-30
2  Catwoman   Bullwhip        NaT

In [9]:
#Drop and keep rows which have at least thresh=thresh non NaN cell
df.dropna(thresh=2)

       name        toy       born
0    Alfred  Batmobile        NaT
1    Batman        NaN 1975-12-30
2  Catwoman   Bullwhip        NaT

In [10]:
#Drop cell with cell from selected columns is NaN
df.dropna(subset=['born'])

     name  toy       born
1  Batman  NaN 1975-12-30

In [11]:
#Thay the du lieu khiem khuyet
df1 = pd.DataFrame(
    [
    [np.nan, 2, np.nan, 0],
    [3, 4, np.nan, 1],
    [np.nan, np.nan, np.nan, 5],
    [np.nan, 3, np.nan, 4]
    ],
    columns=list('ABCD')
)

df1

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5
3  NaN  3.0 NaN  4

In [12]:
#Replace NaN with given value
df1.fillna('Replace NaN')
pass

In [13]:
#Replace NaN with back cell (bfill) or font cell (ffill)
df1.fillna(method='ffill')

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  3.0  4.0 NaN  5
3  3.0  3.0 NaN  4

In [14]:
#Give a dict of value to replace NaN
values = {
    'A': 'replace NaN in A col',
    'B': 'replace NaN in B col',
    'C': 'replace NaN in C col',
    'D': 'replace NaN in D col'
}

df1.fillna(value=values)

                      A                     B                     C  D
0  replace NaN in A col                   2.0  replace NaN in C col  0
1                   3.0                   4.0  replace NaN in C col  1
2  replace NaN in A col  replace NaN in B col  replace NaN in C col  5
3  replace NaN in A col                   3.0  replace NaN in C col  4

In [15]:
s = pd.Series([1, np.nan, np.nan, 3, 1], dtype='float64')
s.interpolate()

0    1.000000
1    1.666667
2    2.333333
3    3.000000
4    1.000000
dtype: float64